@jufemaiz Thanks for raising this issue and sorry that you hit the problem.
None of our acceptance tests exposed the behavior your are seeing but after adapting your example configuration I can reproduce it:

```console
% make testacc TESTARGS='-run=TestAccAPIGatewayDeployment_conflictingConnectionType' PKG=apigateway
==> Checking that code complies with gofmt requirements...
TF_ACC=1 go test ./internal/service/apigateway/... -v -count 1 -parallel 3  -run=TestAccAPIGatewayDeployment_conflictingConnectionType -timeout 180m
=== RUN   TestAccAPIGatewayDeployment_conflictingConnectionType
=== PAUSE TestAccAPIGatewayDeployment_conflictingConnectionType
=== CONT  TestAccAPIGatewayDeployment_conflictingConnectionType
    deployment_test.go:271: Step 1/1 error: After applying this test step, the plan was not empty.
        stdout:
        
        
        Terraform used the selected providers to generate the following execution
        plan. Resource actions are indicated with the following symbols:
          ~ update in-place
        +/- create replacement and then destroy
        
        Terraform will perform the following actions:
        
          # aws_api_gateway_deployment.test must be replaced
        +/- resource "aws_api_gateway_deployment" "test" {
              ~ created_date  = "2023-01-20T16:28:49Z" -> (known after apply)
              ~ execution_arn = "arn:aws:execute-api:us-west-2:187416307283:omb77gq5w6/" -> (known after apply)
              ~ id            = "cn78jr" -> (known after apply)
              ~ invoke_url    = "https://omb77gq5w6.execute-api.us-west-2.amazonaws.com/" -> (known after apply)
              ~ triggers      = { # forces replacement
                  ~ "redeployment" = "8596956da9c859f00f1c36ded4503030bede9d5e" -> "d0ebf389b80c403aeca3b44ee94e6ac52bf1e21d"
                }
                # (2 unchanged attributes hidden)
            }
        
          # aws_api_gateway_integration.test will be updated in-place
          ~ resource "aws_api_gateway_integration" "test" {
              + connection_type         = "INTERNET"
                id                      = "agi-omb77gq5w6-qy43r9-GET"
                # (9 unchanged attributes hidden)
            }
        
        Plan: 1 to add, 1 to change, 1 to destroy.
--- FAIL: TestAccAPIGatewayDeployment_conflictingConnectionType (36.42s)
FAIL
FAIL	github.com/hashicorp/terraform-provider-aws/internal/service/apigateway	41.512s
FAIL
make: *** [testacc] Error 1
```

We will get a fix in place for next week's Terraform AWS Provider release. Until then you can [pin the provider version](https://developer.hashicorp.com/terraform/tutorials/configuration-language/provider-versioning) to **4.50.0**.